app/controllers/recipes_controller.rb

  def index
    fb_id = user_id[:user_id]

    if User.find_by(id: session[:user_id]) == nil
      redirect_to new_session_path("facebook")
    else
      user = User.find_by(id: session[:user_id])
      @recipes = user.recipes.order('created_at desc')
---
SELECT  "users".* FROM "users"  WHERE "uid"."user_id" = '10203511032630116' LIMIT 1
SELECT "recipes".* FROM "recipes"  WHERE "recipes"."user_id" = ?  ORDER BY created_at desc  [["user_id", 2]]

  def create
    fb_id = user_id[:user_id]
    user = User.find_by(id: session[:user_id])

    @recipe = Recipe.new(recipe_params)
    category = category_params[:category] || "Appetizers"
    @recipe.category_id = Category.get_category_id(category)

    @recipe.tag_string = tag_params[:tags]
    tag_array = @recipe.tag_string.split(',')
    tag_array.each do |tag|
      stripped_tag = tag.strip
      if Tag.find_by(name: tag) == nil
        @recipe.tags << Tag.create(name: tag)
      else
        @recipe.tags << Tag.find_by(name: tag)
      end
    end

    if @recipe.save
---
SELECT  "users".* FROM "users"  WHERE "uid"."user_id" = '10203511032630116' LIMIT 1
SELECT  "tags".* FROM "tags"  WHERE "tags"."name" = 'easy' LIMIT 1
INSERT INTO "recipes" ("category_id", "created_at", "img_url", "source_url", "title", "updated_at") VALUES (?, ?, ?, ?, ?, ?)
INSERT INTO "tags" ("created_at", "name", "updated_at") VALUES (?, ?, ?)  [["created_at", "2014-12-03 23:39:15.641826"], ["name", "easy"], ["updated_at", "2014-12-03 23:39:15.641826"]]
SELECT  "categories".* FROM "categories"  WHERE "categories"."name" = 'Appetizers' LIMIT 1
UPDATE "recipes" SET "updated_at" = ?, "user_id" = ? WHERE "recipes"."id" = 13  [["updated_at", "2014-12-03 23:53:40.997143"], ["user_id", 1]]

  def update
    fb_id = user_id[:user_id]
    user = User.find_by(uid: fb_id)
    recipe = Recipe.find(params[:id])

    recipe.title = params[:title]
    recipe.category = Category.find(params[:category_id])
---
SELECT  "users".* FROM "users"  WHERE "users"."uid" = 10203511032630116 LIMIT 1
SELECT  "recipes".* FROM "recipes"  WHERE "recipes"."id" = ? LIMIT 1  [["id", 21]]
SELECT  "categories".* FROM "categories"  WHERE "categories"."id" = ? LIMIT 1  [["id", 3]]